tap "supabase/tap"
brew "cmatrix"
brew "docker"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "powerlevel10k"
brew "powershell"
brew "repomix"
brew "speedtest-cli"
brew "stow"
brew "tailscale"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "supabase/tap/supabase"
cask "adobe-acrobat-pro"
cask "brainfm"
cask "caffeine"
cask "chatgpt"
cask "claude-code"
cask "codexbar"
cask "discord"
cask "dropbox"
cask "google-gemini"
cask "grammarly-desktop"
cask "inkscape"
cask "iterm2"
cask "notion"
cask "postman"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "rectangle"
cask "signal"
cask "slack"
cask "steam"
cask "tailscale-app"
cask "visual-studio-code"
cask "whatsapp"
cask "windows-app"
cask "wispr-flow"
vscode "4ops.terraform"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dracula-theme.theme-dracula"
vscode "eliverlara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tomoki1207.pdf"
vscode "usernamehw.indent-one-space"
vscode "vkrsi.code-screenshot"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
