tap "steipete/tap"
tap "supabase/tap"
tap "weaveworks/tap"
brew "awscli"
brew "cmatrix"
brew "docker"
brew "fzf"
brew "gettext"
brew "gnupg"
brew "pass"
brew "glow"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "helm"
brew "htop"
brew "kubernetes-cli"
brew "openai-whisper"
brew "powerlevel10k"
brew "powershell"
brew "repomix"
brew "ripgrep"
brew "speedtest-cli"
brew "stow"
brew "summarize"
brew "tailscale"
brew "tmux"
brew "tree"
brew "uv"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "supabase/tap/supabase"
brew "weaveworks/tap/eksctl"
cask "adobe-acrobat-pro"
cask "antigravity"
cask "antigravity-cli"
cask "brainfm"
cask "caffeine"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codexbar"
cask "discord"
cask "dropbox"
cask "google-gemini"
cask "grammarly-desktop"
cask "inkscape"
cask "iterm2"
cask "microsoft-office"
cask "notion"
cask "orbstack"
cask "postman"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "rectangle"
cask "signal"
cask "slack"
cask "steam"
cask "tailscale-app"
cask "visual-studio-code"
cask "whatsapp"
cask "windows-app"
cask "wispr-flow"
vscode "4ops.terraform"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "christian-kohler.path-intellisense"
vscode "dorianmassoulier.repomix-runner"
vscode "dracula-theme.theme-dracula"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "mikestead.dotenv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.indent-one-space"
vscode "vkrsi.code-screenshot"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
